Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/edc/ATSAMS70N21B.PIC
      <edc:SFRDef edc:_addr="0x4005C004" edc:access="----------------------------wwww" edc:cname="PWM1_ENA" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:desc="Channel ID" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C008" edc:access="----------------------------wwww" edc:cname="PWM1_DIS" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:desc="Channel ID" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C00C" edc:access="----------------------------rrrr" edc:cname="PWM1_SR" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:desc="Channel ID" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C010" edc:access="------------wwww------------wwww" edc:cname="PWM1_IER1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:desc="Counter Event on Channel 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:desc="Counter Event on Channel 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:desc="Counter Event on Channel 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:desc="Counter Event on Channel 3 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FCHID0" edc:desc="Fault Protection Trigger on Channel 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID1" edc:desc="Fault Protection Trigger on Channel 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID2" edc:desc="Fault Protection Trigger on Channel 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID3" edc:desc="Fault Protection Trigger on Channel 3 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C014" edc:access="------------wwww------------wwww" edc:cname="PWM1_IDR1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:desc="Counter Event on Channel 0 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:desc="Counter Event on Channel 1 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:desc="Counter Event on Channel 2 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:desc="Counter Event on Channel 3 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FCHID0" edc:desc="Fault Protection Trigger on Channel 0 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID1" edc:desc="Fault Protection Trigger on Channel 1 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID2" edc:desc="Fault Protection Trigger on Channel 2 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID3" edc:desc="Fault Protection Trigger on Channel 3 Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C018" edc:access="------------rrrr------------rrrr" edc:cname="PWM1_IMR1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:desc="Counter Event on Channel 0 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:desc="Counter Event on Channel 1 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:desc="Counter Event on Channel 2 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:desc="Counter Event on Channel 3 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FCHID0" edc:desc="Fault Protection Trigger on Channel 0 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID1" edc:desc="Fault Protection Trigger on Channel 1 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID2" edc:desc="Fault Protection Trigger on Channel 2 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID3" edc:desc="Fault Protection Trigger on Channel 3 Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
