Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/edc/ATSAMS70N21B.PIC
      <edc:AdjustPoint edc:_addr="0x40088104" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x40088114" edc:access="-------------------n----nnnn----" edc:cname="CCFG_SYSIO" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SYSIO4" edc:desc="PB4 or TDI Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYSIO5" edc:desc="PB5 or TDO/TRACESWO Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYSIO6" edc:desc="PB6 or TMS/SWDIO Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYSIO7" edc:desc="PB7 or TCK/SWCLK Assignment" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SYSIO12" edc:desc="PB12 or ERASE Assignment" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40088118" edc:access="---------nnn--------------------" edc:cname="CCFG_PCCR" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="TC0CC" edc:desc="TC0 Clock Configuration" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2SC0CC" edc:desc="I2SC0 Clock Configuration" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2SC1CC" edc:desc="I2SC1 Clock Configuration" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4008811C" edc:access="-----------------------------nnn" edc:cname="CCFG_DYNCKG" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MATCKG" edc:desc="MATRIX Dynamic Clock Gating" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BRIDCKG" edc:desc="Bridge Dynamic Clock Gating Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EFCCKG" edc:desc="EFC Dynamic Clock Gating Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40088120" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40088124" edc:access="---------------------------nnnnn" edc:cname="CCFG_SMCNFCS" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SMC_NFCS0" edc:desc="SMC NAND Flash Chip Select 0 Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMC_NFCS1" edc:desc="SMC NAND Flash Chip Select 1 Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMC_NFCS2" edc:desc="SMC NAND Flash Chip Select 2 Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMC_NFCS3" edc:desc="SMC NAND Flash Chip Select 3 Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SDRAMEN" edc:desc="SDRAM Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40088128" edc:offset="0xBC"/>
      <edc:SFRDef edc:_addr="0x400881E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="MATRIX_WPMR" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x4D4154"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400881E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="MATRIX_WPSR" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400881EC" edc:offset="0x3E14"/>
      <edc:SFRDef edc:_addr="0x4008C000" edc:access="------------------------w-wwwwww" edc:cname="I2SC0_CR" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXDIS" edc:desc="Receiver Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CKEN" edc:desc="Clocks Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CKDIS" edc:desc="Clocks Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="Transmitter Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXDIS" edc:desc="Transmitter Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4008C004" edc:access="nnnnnnnn--nnnnnn-nnn-nnnnn-nnn-n" edc:cname="I2SC0_MR" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Inter-IC Sound Controller Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SLAVE" edc:desc="I2SC_CK and I2SC_WS pin inputs used as bit clock and word select/frame synchronization." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MASTER" edc:desc="Bit clock and word select/frame synchronization generated by I2SC from MCK and output to I2SC_CK and I2SC_WS pins. Peripheral clock or GCLK is output as master clock on I2SC_MCK if I2SC_MR.IMCKMODE is set." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DATALENGTH" edc:desc="Data Word Length" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_32_BITS" edc:desc="Data length is set to 32 bits" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_24_BITS" edc:desc="Data length is set to 24 bits" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_20_BITS" edc:desc="Data length is set to 20 bits" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_18_BITS" edc:desc="Data length is set to 18 bits" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_16_BITS" edc:desc="Data length is set to 16 bits" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_16_BITS_COMPACT" edc:desc="Data length is set to 16-bit compact stereo. Left sample in bits 15:0 and right sample in bits 31:16 of same word." edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_8_BITS" edc:desc="Data length is set to 8 bits" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_8_BITS_COMPACT" edc:desc="Data length is set to 8-bit compact stereo. Left sample in bits 7:0 and right sample in bits 15:8 of the same word." edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FORMAT" edc:desc="Data Format" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="I2S" edc:desc="I2S format, stereo with I2SC_WS low for left channel, and MSB of sample starting one I2SC_CK period after I2SC_WS edge" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LJ" edc:desc="Left-justified format, stereo with I2SC_WS high for left channel, and MSB of sample starting on I2SC_WS edge" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXMONO" edc:desc="Receive Mono" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXDMA" edc:desc="Single or Multiple DMA Controller Channels for Receiver" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXLOOP" edc:desc="Loopback Test Mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXMONO" edc:desc="Transmit Mono" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXDMA" edc:desc="Single or Multiple DMA Controller Channels for Transmitter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSAME" edc:desc="Transmit Data when Underrun" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="IMCKDIV" edc:desc="Selected Clock to I2SC Master Clock Ratio" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="IMCKFS" edc:desc="Master Clock to fs Ratio" edc:nzwidth="0x6">
              <edc:SFRFieldSemantic edc:cname="M2SF32" edc:desc="Sample frequency ratio set to 32" edc:when="(field &amp; 0x3F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="M2SF64" edc:desc="Sample frequency ratio set to 64" edc:when="(field &amp; 0x3F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="M2SF96" edc:desc="Sample frequency ratio set to 96" edc:when="(field &amp; 0x3F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="M2SF128" edc:desc="Sample frequency ratio set to 128" edc:when="(field &amp; 0x3F) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="M2SF192" edc:desc="Sample frequency ratio set to 192" edc:when="(field &amp; 0x3F) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="M2SF256" edc:desc="Sample frequency ratio set to 256" edc:when="(field &amp; 0x3F) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="M2SF384" edc:desc="Sample frequency ratio set to 384" edc:when="(field &amp; 0x3F) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="M2SF512" edc:desc="Sample frequency ratio set to 512" edc:when="(field &amp; 0x3F) == 0xF"/>
              <edc:SFRFieldSemantic edc:cname="M2SF768" edc:desc="Sample frequency ratio set to 768" edc:when="(field &amp; 0x3F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="M2SF1024" edc:desc="Sample frequency ratio set to 1024" edc:when="(field &amp; 0x3F) == 0x1F"/>
              <edc:SFRFieldSemantic edc:cname="M2SF1536" edc:desc="Sample frequency ratio set to 1536" edc:when="(field &amp; 0x3F) == 0x2F"/>
              <edc:SFRFieldSemantic edc:cname="M2SF2048" edc:desc="Sample frequency ratio set to 2048" edc:when="(field &amp; 0x3F) == 0x3F"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IMCKMODE" edc:desc="Master Clock Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IWS" edc:desc="I2SC_WS Slot Width" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
